# Задача 3. Почта

# Василий пришёл получать посылку на почту. 
# Разумеется, в почтовом извещении ему нужно было написать свои фамилию, имя и адрес проживания,
# чтобы кто-нибудь не получил посылку за него, например члены его семьи (а им бы хотелось!).

# Напишите функцию для вывода фамилии, имени и адреса для трех членов семьи, живущих в разных городах. Выведите информацию без цикла.


def card(name, city):
    print("Фамилия: Иванов")
    print("Имя:", name)
    print("Город:", city)
    print("Улица: Пушкина")
    print("Дом: Колотушкина\n")

card('Алёна', "Москва")
card("Егорий", "Уренгой")
card("Акакий", "Истра")
