print('Задача 3. Рамка')
print()
# Напишите программу,
# которая рисует с помощью символьной графики прямоугольную рамку.
# Для вертикальных линий используйте символ вертикального штриха “|”,
# а для горизонтальных - дефис “-”. Пусть пользователь вводит ширину и высоту рамки.

#  _ _ _ _ _ _ _ _ _
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |                 |
# |_ _ _ _ _ _ _ _ _|

length = int(input('Введите длину рамки: '))
width = int(input('Введите ширину рамки: '))


for row in range(1, length + 1):
    for col in range(1, width + 1):
        if row == 1:
            print("-", end = "")
        elif row == length:
            print("-", end = "")
        elif col == 1:
            print("|", end = "")
        elif col == width:
            print("|", end = "")
        else:
            print(" ", end = "")
    print()